waitUntil { player == player };

player createDiaryRecord ["diary", ["Відомі баги",
"<br/>Сторони чують один одну в меню відродження.
<br/>Підкласи інколи знаходяться в невірних класах, або класи взагалі відсутні.
<br/>Назви точок перемішуються.
<br/>Подвійні точки спавну.
"]];

player createDiaryRecord ["diary", ["Зовнішній вигляд сторін", " 

<br/>Cині:
<br/> 
<br/> 
<img image='blufor1.jpg' width='340' height='518'/>
<br/>
<br/>
<br/>Червоні:
<br/>
<br/>
<img image='opfor1.jpg' width='340' height='518'/>
"]];


player createDiaryRecord ["diary", ["УМОВНОСТІ",
"<font face='EtelkaNarrowMediumPro' color='#EF8A13'>ЗАГАЛЬНЕ:</font>
<br/>
<br/>Кількість захисників, необхідна для неможливості захоплення сектора: <font color='#ff0000'>2</font>
<br/>Кількість атакуючих, необхідна для захоплення сектора, при умові, що захисників у зоні менше 2: <font color='#ff0000'>2</font>
<br/>Час, необхідний для захоплення сектора: <font color='#EF8A13'>30</font> секунд
<br/>Увімкнено швидке захоплення (пустий сектор може захопити 1 людина).
<br/>
<font face='EtelkaNarrowMediumPro' color='#C33509'> ЗАБОРОНЕНО:</font>
<br/>
<br/>[1]Виходити/виїзджати за обмежувальні лінії.
<br/>[2]Свинособаче ставлення до гри.
<br/>[3]Колоти морфіном гравців в техніці.
<br/>[4]Руйнувати гру союзникам.
<br/>[5]Використовувати чужу техніку/спорядження.
"]];

player createDiaryRecord ["diary", ["ЗАВДАННЯ",
"<font face='EtelkaNarrowMediumPro'>ОСНОВНІ ЗАВДАННЯ:</font>
<br/>
<br/>Ви повинні опустити ворожі очки до нуля.
<br/>Якщо у вас більше на 1 точку, ворог втрачає 1 очко в секунду.
<br/>Якщо у вас більше на 2 точки, ворог втрачає 3 очка в секунду.
<br/>"]];

player createDiaryRecord ["diary", ["МЕХАНІКИ",
"<br/>Таймер респавну гравців - 20 сек. Захист після спавну - 5 сек.
<br/>УВАГА! 
<br/>Пошкоджена техніка знищується, якщо відійти від неї на 70м (тікет витрачається).
<br/>Ціла техніка повертається на спавн, якщо відійти від неї на 70м (тікет не витрачається).
<br/>
<br/>Інженер може ремонтувати техніку набором для інструментів.
<br/>Медицина спрощена, оглушення вимкнене.
<br/>Можна подивитися список вбитих противників та вашого вбивцю, натиснувши End після смерті.
<br/>На мапі автоматично оновлюються мітки на союзників.
<br/>
<br/>На техніці можна створити бота-водія через АСЕ меню.
"]];


